; domain
(define (domain blocky-game)
    (:requirements :strips :typing :derived-predicates)
    (:types
        place - object ; names of places should conform to pattern placeXY, where X and Y have the same number of digits
        room - object
        person - object
        thing - object
        takeable - thing
        key - takeable
        terminal - thing
        exit - thing
        entrance - object
        direction - object
        colour - object)
    (:constants
        up down left right - direction)
    (:predicates
        (at ?room - room
            ?place - place)
        (in ?person - person
            ?room - room)
        (contains ?room - room
            ?thing - thing)
        (adjacent ?place1 - place
            ?place2 - place
            ?direction - direction)
        (passage ?room - room
            ?entrance - entrance
            ?direction - direction)
        (has_door ?entrance - entrance
            ?colour - colour)
        (owned ?thing - takeable
            ?person - person)
        (is ?key - key
            ?colour - colour)
        (reversed ?direction - direction
            ?reverse_direction - direction)
        (free ?place - place)
        (escaped ?person - person))
    ; poor support, should be defined in each problem instance
    ; (:timeless
    ;     (reversed up down)
    ;     (reversed down up)
    ;     (reversed left right)
    ;     (reversed right left))
    (:action go
        :parameters (
            ?person - person
            ?room1 - room
            ?room2 - room
            ?place1 - place
            ?place2 - place
            ?entrance1 - entrance
            ?entrance2 - entrance
            ?direction - direction
            ?reverse_direction - direction
            ?colour - colour
            ?key - key)
        :precondition (and
            (adjacent ?place1 ?place2 ?direction)
            (at ?room1 ?place1)
            (at ?room2 ?place2)
            (passage ?room1 ?entrance1 ?direction)
            (passage ?room2 ?entrance2 ?reverse_direction)
            (has_door ?entrance1 ?colour)
            (has_door ?entrance2 ?colour)
            (in ?person ?room1)
            (owned ?key ?person)
            (is ?key ?colour))
        :effect (and
            (not (in ?person ?room1))
            (in ?person ?room2)))
    (:action take
        :parameters (
            ?person - person
            ?thing - takeable
            ?room - room)
        :precondition (and
            (contains ?room ?thing)
            (in ?person ?room))
        :effect (and
            (not (contains ?room ?thing))
            (owned ?thing ?person)))
    (:action escape
        :parameters (
            ?person - person
            ?exit - exit
            ?room - room)
        :precondition (and
            (contains ?room ?exit)
            (in ?person ?room))
        :effect (and
            (escaped ?person)))
    (:action move
        :parameters (
            ?moved_room - room
            ?place1 - place
            ?place2 - place
            ?direction - direction
            ?person - person
            ?dwelled_room - room
            ?terminal - terminal)
        :precondition (and
            (in ?person ?dwelled_room)
            (contains ?dwelled_room ?terminal)
            (free ?place2)
            (at ?moved_room ?place1)
            (adjacent ?place1 ?place2 ?direction))
        :effect (and
            (free ?place1)
            (not (free ?place2))
            (not (at ?moved_room ?place1))
            (at ?moved_room ?place2)))
)

; problem
(define (problem blocky-problem1)
    (:domain blocky-game)
    (:objects
        place11 place12 place13 - place
        place21 place22 place23 - place
        place31 place32 place33 - place
        room1 room2 room3 room4 - room
        entrance11 entrance12 - entrance
        entrance21 entrance22 - entrance
        entrance31 - entrance
        entrance41 - entrance
        key_black key_yellow key_blue - key
        black yellow blue - colour
        terminal1 - terminal
        exit - exit
        person - person)
    (:init
        (reversed right left)
        (reversed up down)
        (reversed down up)
        (reversed left right)

        (is key_black black)
        (is key_yellow yellow)
        (is key_blue blue)

        (adjacent place11 place21 down)
        (adjacent place11 place12 right)
        
        (adjacent place21 place31 down)
        (adjacent place21 place22 right)
        (adjacent place21 place11 up)

        (adjacent place31 place32 right)
        (adjacent place31 place21 up)

        (adjacent place12 place22 down)
        (adjacent place12 place13 right)
        (adjacent place12 place11 left)

        (adjacent place22 place32 down)
        (adjacent place22 place23 right)
        (adjacent place22 place21 left)
        (adjacent place22 place12 up)

        (adjacent place32 place33 right)
        (adjacent place32 place31 left)
        (adjacent place32 place22 up)

        (adjacent place13 place23 down)
        (adjacent place13 place12 left)

        (adjacent place23 place33 down)
        (adjacent place23 place22 left)
        (adjacent place23 place13 up)

        (adjacent place33 place32 left)
        (adjacent place33 place23 up)

        (at room1 place12)
        (at room2 place31)
        (at room3 place13)
        (at room4 place33)

        (free place11)
        (free place21)

        (free place22)
        (free place32)

        (free place23)

        (passage room1 entrance11 up)
        (passage room1 entrance12 right)

        (passage room2 entrance21 left)
        (passage room2 entrance22 up)

        (passage room3 entrance31 down)

        (passage room4 entrance41 down)

        (has_door entrance11 blue)
        (has_door entrance12 black)

        (has_door entrance21 black)
        (has_door entrance22 yellow)

        (has_door entrance31 blue)
        
        (has_door entrance41 yellow)

        (contains room1 key_black)
        (contains room2 key_yellow)
        (contains room4 key_blue)

        (contains room3 exit)

        (contains room1 terminal1)

        (in person room1))
    (:goal
        (escaped person))
)

; plan
1. (take person key_black room1)
   deleted: (contains room1 key_black)
   added: (owned key_black person)
   goals met: 0 of 1
2. (move room1 place12 place11 left person room1 terminal1)
   deleted: (free place11) (at room1 place12)
   added: (free place12) (at room1 place11)
   goals met: 0 of 1
3. (move room1 place11 place21 down person room1 terminal1)
   deleted: (free place21) (at room1 place11)
   added: (free place11) (at room1 place21)
   goals met: 0 of 1
4. (move room2 place31 place32 right person room1 terminal1)
   deleted: (free place32) (at room2 place31)
   added: (free place31) (at room2 place32)
   goals met: 0 of 1
5. (move room3 place13 place12 left person room1 terminal1)
   deleted: (free place12) (at room3 place13)
   added: (free place13) (at room3 place12)
   goals met: 0 of 1
6. (move room3 place12 place11 left person room1 terminal1)
   deleted: (free place11) (at room3 place12)
   added: (free place12) (at room3 place11)
   goals met: 0 of 1
7. (move room4 place33 place23 up person room1 terminal1)
   deleted: (free place23) (at room4 place33)
   added: (free place33) (at room4 place23)
   goals met: 0 of 1
8. (move room4 place23 place22 left person room1 terminal1)
   deleted: (free place22) (at room4 place23)
   added: (free place23) (at room4 place22)
   goals met: 0 of 1
9. (move room1 place21 place31 down person room1 terminal1)
   deleted: (free place31) (at room1 place21)
   added: (free place21) (at room1 place31)
   goals met: 0 of 1
10. (move room3 place11 place21 down person room1 terminal1)
   deleted: (free place21) (at room3 place11)
   added: (free place11) (at room3 place21)
   goals met: 0 of 1
11. (go person room1 room2 place31 place32 entrance12 entrance21 right left black key_black)
   deleted: (in person room1)
   added: (in person room2)
   goals met: 0 of 1
12. (take person key_yellow room2)
   deleted: (contains room2 key_yellow)
   added: (owned key_yellow person)
   goals met: 0 of 1
13. (go person room2 room4 place32 place22 entrance22 entrance41 up down yellow key_yellow)
   deleted: (in person room2)
   added: (in person room4)
   goals met: 0 of 1
14. (take person key_blue room4)
   deleted: (contains room4 key_blue)
   added: (owned key_blue person)
   goals met: 0 of 1
15. (go person room4 room2 place22 place32 entrance41 entrance22 down up yellow key_yellow)
   deleted: (in person room4)
   added: (in person room2)
   goals met: 0 of 1
16. (go person room2 room1 place32 place31 entrance21 entrance12 left right black key_black)
   deleted: (in person room2)
   added: (in person room1)
   goals met: 0 of 1
17. (go person room1 room3 place31 place21 entrance11 entrance31 up down blue key_blue)
   deleted: (in person room1)
   added: (in person room3)
   goals met: 0 of 1
18. (escape person exit room3)
   added: (escaped person)
   goals met: 1 of 1
